[
  {
    "period": "Sep 2024 - Present",
    "title": "Full Stack Developer",
    "company": "Reimagine Health",
    "description": "Building telehealth applications to reimagine the future of healthcare.\n\nImplemented smooth and secure checkout experiences, integrating Stripe webhooks, Firebase authentication, and MongoDB user creation steps.\n\nDeveloped an internal dashboard with practitioner scheduling, a chat system with drag-and-drop attachment uploads, cron jobs to batch process SMS and email notifications, Python scripts to generate booking CSV reports and invoice forms, and integrated data from multiple sources (linking intake forms to visits, products to orders, and orders to visits).\n\nAdditionally, crafted beautiful landing pages on Next.js, focusing on user experience to drive conversion, and embedded Google AdSense into pages.",
    "techStack": ["Next.js", "GraphQL", "Firebase Auth", "Resend", "Twilio", "Zapier", "Stripe", "Python", "MongoDB", "OpenAI (Prompt Engineering)"]
  },
  {
    "period": "Jan 2024 - Apr 2024",
    "title": "Full Stack Developer",
    "company": "Nuralogix",
    "description": "Initially, I started by creating a few reusable components for our task management application. As the application grew and more features were added, the number of components increased significantly. To manage this complexity, I developed a React component library using TypeScript, Storybook, Vite, StyleX, and RollUp.\n\nThis library allowed us to package and deploy components as npm packages, making it easier to maintain and scale our application. Over time, this component library evolved into a comprehensive UI Design System, enabling our team to build software faster and more efficiently.",
    "techStack": ["React", "Storybook", "Vitest", "StyleX", "RollUp"]
  },
  {
    "period": "May 2023 - Sep 2023",
    "title": "Software Developer",
    "company": "Proceve",
    "description": "Engineered over 25 reusable components for a Project Management Console, significantly boosting server performance with concurrent task processing using Go routines.\n\nImplemented RESTful API endpoints and middleware functions in Gin, modified controllers to perform CRUD actions on MongoDB collections, and enhanced user experience with SvelteKit's filesystem-based routing.",
    "techStack": ["Svelte", "Go", "REST API", "Goroutines", "SvelteKit"]
  },
  {
    "period": "Sep 2022 - Dec 2022",
    "title": "Software Engineering Intern",
    "company": "Super.com",
    "description": "Enhanced an E-commerce storefront by optimizing network requests with REST and GraphQL, and implemented automated E2E testing to replace 40% of manual test cases.\n\nStrategically combined REST and GraphQL methods to optimize network requests, leading to reduced response time and more efficient data fetching.",
    "techStack": ["Next.js", "TypeScript", "GraphQL", "Jest", "WebdriverIO"]
  },
  {
    "period": "Jan 2022 - Apr 2022",
    "title": "Product Developer",
    "company": "blueRover",
    "description": "Processed over 10,000 IoT device messages in real-time using RabbitMQ and created dynamic visualizations of sensor data with React.\n\nLeveraged RabbitMQ as a MQTT broker to process messages generated by IoT devices and subscribed to RabbitMQ from React hooks using MQTT.js to generate alerts in near real-time.",
    "techStack": ["RabbitMQ", "MQTT", "React", "MUI", "TailwindCSS"]
  },
  {
    "period": "May 2021 - Aug 2021",
    "title": "Software Developer",
    "company": "SaFuture",
    "description": "Developed responsive web applications for displaying GIS data using Angular and built a custom image editor with OCR capabilities using Google Cloud Vision, jQuery, and JavaScript.",
    "techStack": ["Angular", "jQuery", "JavaScript", "Google Cloud Vision", "GIS"]
  }
]
